Repository: oscarahalvorsen/masterproject
Catalog: maalfrid/tmx/udir.no.csv-en-nb.deduped.tmx
Source language: en
Languages: nb

source: Extreme climatic and weather conditions and natural disasters can take many lives, leaving enormous destruction behind and leading to great human, social and economic suffering.
nb: Ekstreme klima- og værsituasjoner og naturkatastrofer kan kreve mange liv, etterlate seg enorme ødeleggelser og føre til store menneskelige, samfunnsmessige og økonomiske påkjenninger.

source: master vocabulary that covers a range of topics
nb: uttrykke og begrunne egen mening om forskjellige emner

source: Being able to use digital tools
nb: Å kunne bruke digitale verktøy

source: ‘Children are in constant motion.
nb: – Barn er i bevegelse hele tiden.

source: use craft techniques and hand tools for shaping wood, clay and textiles
nb: bruke håndverksteknikker og håndverktøy i utforming av tre, leire og

source: Two children, Lisa and Maya, are going to paint with water colours, using easels.
nb: To barn, Lisa og Maya, skal male akvarell på staffelier.

source: The Norwegian Institute of Public Health and Directorate for Education and Training have developed guidelines with various levels of recommendations (traffic light model), aimed at maintaining infection control in schools and kindergartens with varying infection levels, both locally and/or nationally.
nb: Folkehelseinstituttet og Utdanningsdirektoratet har utarbeidet veiledere med graderte råd (trafikklysmodellen) for å ivareta smittevernet i skoler og barnehager ved varierende smittenivå lokalt og/eller nasjonalt.

source: The table also shows that alternative D was popular in Norway – much more popular, in fact, than in any of the reference countries.
nb: Tabellen viser at også alternativ D har vært populært i Norge, faktisk mye mer populært enn i noen av referanselandene.

source: English literature and other cultural expressions can be a wellspring of experience, satisfaction and personal growth.
nb: Engelskspråklig litteratur og andre kulturuttrykk kan være kilder til opplevelse, glede og personlig vekst.

source: Approximately 95 per cent were women, and 5 per cent were men.
nb: Rundt 95 prosent var kvinner, og 5 prosent var menn.

source: The teacher shall provide guidance on further learning and adapt the teaching to enable the pupils to use the guidance provided to develop their competence in exploring different representations and problem solving strategies and their competence in communication with mathematical terminology.
nb: Læreren skal gi veiledning om videre læring og tilpasse opplæringen slik at elevene kan bruke veiledningen for å utvikle kompetansen sin i utforsking av ulike representasjoner og problemløsingsstrategier og kompetansen sin i kommunikasjon med matematiske begreper.

source: Human rights in practical politics
nb: Kildebruk og kildekritikk inngår i hovedområdet.

source: This implies that the subject be taught impartially and based on facts, and that the different world religions and philosophies of life shall be presented with respect.
nb: Det innebærer at den skal være saklig og upartisk og at de ulike verdensreligioner og livssyn skal presenteres med respekt.

source: It also involves developing skills to understand and interpret the content of a variety of texts.
nb: Det dreier seg også om å utvikle ferdigheter til å forstå og tolke innholdet i varierte tekster.

source: Mathematics has a particular responsibility for teaching numeracy skills.
nb: Matematikk har et særlig ansvar for opplæringen i å kunne regne.

source: The main subject area deals with key issues related to literature and culture in the English-speaking world, and includes literary texts and other artistic means of expression, such as visual art, theatre, music and architecture from various time periods and different parts of the world.
nb: Hovedområdet dreier seg om sentrale emner knyttet til litteratur og kultur i den engelskspråklige verden, og omfatter litterære tekster og andre kunstneriske uttrykksmidler, som bildende kunst, teater, musikk og arkitektur fra ulike tidsepoker og deler av verden.

source: The social studies subject at upper secondary level comprises the following main subject areas: the individual and society, working and business life, politics and democracy, culture and international relations.
nb: Samfunnsfaget i videregående opplæring omfatter hovedområdene individ og samfunn, arbeids- og næringsliv, politikk og demokrati, kultur, og internasjonale forhold.

source: formulate and solve problems from one’s everyday life concerning
nb: formulere og løse problemer fra sin egen hverdag som har med

source: describe his or her own observations from experiments and in nature
nb: beskrive egne observasjoner fra forsøk og fra naturen

source: Look at football, how people sing at the tribunes.
nb: Se for eksempel på fotballen, hvor mye det synges på tribunene.

source: These are the results of a survey of 998 kindergarten teachers and 1357 assistants in a random sample of Norwegian kindergartens.
nb: Dette viser en surveyundersøkelse som involverer 998 barnehagelærere og 1357 assistenter i et tilfeldig utvalg norske barnehager.

source: The programme subject mathematics for the natural sciences gives specialization in mathematics for further education and work within natural science, medicine, technology, computer studies, economics and education.
nb: Programfaget matematikk for realfag gir fordypning i matematikk for videre studier og arbeid innen naturvitenskap, medisin, teknologi, datafag, økonomi og utdanningssektoren.

source: The ability to express oneself orally and in writing means being able to reflect on the content of meaning in texts, images, film and artefacts, and being able to compare, argue and discuss the value of information and sources, and in hypotheses and models.
nb: Skriftlig og muntlig uttrykksevne betyr å kunne reflektere over meningsinnholdet i tekster, bilder, film og gjenstander, og å kunne sammenligne, argumentere og drøfte verdier i informasjon og kilder, i hypoteser og modeller.

source: give examples of how words and pictures work together in texts
nb: gi eksempler på hvordan ord og bilde virker sammen i tekster

source: the causes and consequences of terrorism and genocide, such as the Holocaust, and
nb: årsaker til og konsekvenser av terrorhandlinger og folkemord, som holocaust, og

source: They also interviewed 14 preschool head teachers and two teachers.
nb: De har i tillegg intervjuet 14 styrere og to barnehagelærere.

source: use sources in a critical and verifiable way and master digital citation
nb: bruke kilder på en kritisk og etterprøvbar måte og beherske digital kildehenvisning

source: Mathematics teachers in 3MX
nb: Matematikklærne i 3MX

source: use different units of measurement for length and mass in practical
nb: bruke ulike måleenheter for lengde og masse i praktiske situasjoner og

source: Shadowing pedagogical leaders
nb: Har fotfulgt pedagogiske ledere

source: Reports on what the children have said in the Language Unit are hung on the wall, so that the parents can follow along with the children’s linguistic development.
nb: Det barna har sagt i Språkavdelingen, henges på veggen, slik at foreldrene kan følge med på barnas språkutvikling.

source: navigate large volumes of text of varying complexity and select, summarise and evaluate relevant informationLæreplan i norsk for hørselshemmede
nb: orientere seg i store mengder tekst av ulik kompleksitet og velge, sammenfatte og vurdere relevant informasjon

source: The main subject area called The Researcher is essential to all the other main subject areas within primary, lower secondary and upper secondary education.
nb: Utforskeren er et hovedområde som griper over og inn i de andre hovedområdene i faget, både i grunnskolen og i videregående opplæring.

source: Ergonomist Maiken Marie Jordal has engaged in participative observation in a large, modern kindergarten in Oslo.
nb: Ergoterapeut Maiken Marie Jordal har gjort deltakende observasjon i en stor, moderne barnehage i Oslo.

source: solve differential equations and draw vector diagrams and integral curves, and interpret them using digital tools
nb: løse differensiallikninger og tegne retningsdiagrammer og integralkurver, og tolke dem ved å bruke digitale hjelpemidler

source: Reading in Mathematics involves sorting through information, analysing and evaluating form and content, and summarising information from different elements in the texts.
nb: Lesing i matematikk innebærer å sortere informasjon, analysere og vurdere form og innhold og sammenfatte informasjon fra ulike elementer i tekster.

source: These skills also cover the use of digital presentation and collaboration tools to prepare, present and publish multimedia products.
nb: Ferdighetene omfatter også å bruke digitale presentasjons- og samarbeidsverktøy til å utarbeide, presentere og publisere multimediale produkter.

source: It shall stimulate the pupil to think, comprehend and reflect on the interaction between the individual and society.
nb: Det skal stimulere den enkelte til å tenke, forstå og reflektere over samspillet mellom individ og samfunn.

source: carry out experiments with sound, hearing and noise, describe and explain the results and how we may protect ourselves from unwanted sounds
nb: gjennomføre forsøk med lyd, hørsel og støy, beskrive og forklare resultatene og hvordan vi kan skjerme oss mot uønsket lyd

source: describe the reference system and the notation used in formulas in a spreadsheet, and use spreadsheets to carry out and present simple calculations
nb: beskrive referansesystemet og notasjonen som blir benyttet for formler i et regneark, og bruke regneark til å utføre og presentere beregninger

source: Competence aims after year 9
nb: Kompetansemål etter 9. trinn

source: The grade awarded for coursework shall reflect the overall competence of the pupil in social science after completing the subject.
nb: Standpunktkarakteren skal være uttrykk for den samlede kompetansen eleven har i samfunnskunnskap ved avslutningen av opplæringen i faget.

source: The subject is part of many vital areas in society, including medicine, economics, technology, communication, energy management and construction.
nb: Faget griper inn i mange vitale samfunnsområder, som medisin, økonomi, teknologi, kommunikasjon, energiforvaltning og byggevirksomhet.

source: SFO shall facilitate the participation of
nb: nordmenn som bor fast i utlandet

source: Infection control measures must be adapted to the local situation.
nb: Ansatte må holde avstand til kollegaer og foresatte (minst én meter).

source: The ones we really need to devote attention to, though, are the one in 10 who fail to thrive.
nb: Men de vi virkelig skal være oppmerksomme på, er de 10 prosentene som ikke har det så bra.

source: It also deals with evaluating the product's functionalities.
nb: Det kan være lett å miste fokus på utviklingsarbeidet i SFOs hverdagsliv.

source: use various aesthetic forms of expression in composite texts
nb: bruke kunnskap om språk og tekst i utforskende og vurderende samtaler om original tegnspråktekst

source: His colleague Håkon Sakshaug agrees.
nb: Kollega Håkon Sakshaug sier seg enig.

source: plan, create and refine own texts manually and digitally and evaluate them during the process by applying their knowledge of language and texts
nb: planlegge, utforme og bearbeide egne tekster manuelt og digitalt og vurdere dem underveis i prosessen ved hjelp av kunnskap om språk og tekst

source: explain how production and consumption can destroy ecosystems and pollute the soil, water and air, and discuss and elaborate on how this might be prevented and repaired
nb: forklare hvordan produksjon og forbruk kan føre til ødeleggelse av økosystemer og forurensning av jord, vann og luft, og drøfte hvordan dette kan hindres og repareres

source: By giving prepared oral presentations and engaging in spontaneous oral interaction, the pupils should develop their ability to communicate with each other and to express their own thoughts and ideas using a varied vocabulary within different genres.
nb: Muntlig kommunikasjon er en grunnleggende menneskelig aktivitet som i norskfaget utvikles gjennom bruk av ulike språklige roller og systematisk opplæring i ulike sjangere.

source: express themselves using vocabulary appropriate to the content and communication situation
nb: drøfte og vurdere skjønnlitterære tekster med utgangspunkt i egne opplevelser og med forståelse for språk og innhold

source: In comparison around 10 percent of the staff are men in Norwegian kindergartens.
nb: Til sammenligning utgjør menn om lag 10 prosent av dem som jobber i norske barnehager.

source: compare the way people live and socialise in various cultures in English-speaking countries and in Norway, including the Sami culture
nb: samtale om levesett og omgangsformer i ulike kulturer i engelskspråklige land og i Norge, deriblant samisk kultur

source: express their own feelings and opinions in what they write
nb: uttrykke egne følelser og meninger i egen skriving

source: Norwegian Sign Language should allow the pupils to develop linguistic and textual competence according to the abilities and potential of each individual pupil.
nb: Gjennom tegnspråklig samhandling med andre, i arbeid med egne tekster og i møte med andres tekster, vil barn og unge innlemmes i kultur og samfunnsliv.

source: develop and use methods for counting in his or her head, make estimates and written calculations, and use a calculator for these methods
nb: utvikle, bruke og diskutere metoder for hoderegning, overslagsregning og skriftlig regning, og bruke digitale verktøy i beregninger

source: And it is never too cold either.
nb: Det er heller aldri for kaldt.

source: Given that it takes nothing short of a miracle to get little Anna to nap at home, in a quiet room, how can she possibly fall asleep when she is surrounded by 20 other children?
nb: Når det er umulig å få lille Anna til å sove middagslur hjemme, i et stille rom, hvordan kan hun da sovne sammen med 20 andre barn?

source: To describe something may also refer to using relevant terminology to systematise knowledge of a topic.
nb: Å beskrive noe kan også være å bruke relevante fagbegreper for å systematisere kunnskap om emnet.

source: use natural science terms to describe and present his or her own observations in various ways
nb: bruke naturfaglige begreper til å beskrive og presentere egne observasjoner på ulike måter

source: discuss linguistic and multidisciplinary topics using specialist terminology and coherent arguments
nb: uttrykke seg skriftlig og muntlig på en situasjonstilpasset måte, med flyt, presisjon og sammenheng

source: Was it because they wanted to?
nb: Var det fordi de hadde lyst?

source: In a scientific article he analyses four important documents: the OECD-report “Starting Strong III”, the white paper on quality in the kindergarten today and in the future, and finally the previous Framework Plan for the content and the tasks of kindergartens.
nb: OECD-rapporten Starting Strong III, stortingsmeldingene om kvalitet i barnehagen og framtidens barnehage og den forrige rammeplanen for barnehagens innhold og oppgaver.

source: the opportunities and challenges related to diversity
nb: muligheter og utfordringer ved mangfold

source: Learning in the subject shall emphasise environment, health and safety.
nb: Opplæringen skal legge vekt på samarbeid med kollegaer og andre yrkesutøvere på bygge- og anleggsplasser.

source: Those I talked to said there were few specifics about this in the Framework Plan for Kindergartens, and they felt they were largely left to their own devices’, Jernes divulges.
nb: De jeg snakket med, mente at det sto lite konkret om dette i rammeplanen for barnehagen, og at mye ble overlatt til dem selv, forteller Jernes.

source: The subject of Social science allows pupils to develop an understanding of how they can influence the local community, the global community and their own situation in life.
nb: Faget skal bidra til elevenes bevisste identitetsdanning og flerkulturelle kompetanse, styrke samiske elevers identitet og skape en trygg forankring i eget samfunn og egen kultur.

source: All Swedish kindergartens are cognisant of gender and equality.
nb: Det finnes en tanke om kjønn og likestilling i alle svenske barnehager.

source: They also apply to adult education (see separate section).
nb: Ansatte i skolen har derfor en sentral rolle for å ivareta elevene også i en pandemisituasjon.

source: The pupil is expected to be able to
nb: utvikle og bruke kostymer, rekvisitter og kulisser som passer til

source: When the child placed the boat on the water, it sank.
nb: Da barnet la båten på vannet, sank den.

source: Writing Norwegian is also a way of developing and structuring ideas and thoughts and a method for learning.
nb: Begrepet ”lytte” skal i læreplanen forstås som den prosessen der en mottar og konstruerer mening.

source: criticism and create artistic expression to highlight issues in their own era
nb: samfunnskritikk, og skape kunstuttrykk som belyser utfordringer i egen samtid

source: It also involves formulating written summaries and reports associated with subject-specific themes and tasks.
nb: I tillegg innebærer det å utforme skriftlige oppsummeringer og rapporter i forbindelse med fagspesifikke temaer og oppgaver.

source: The pupils shall learn to improve their numeracy skills so that they can manage their spending and understand their personal finances.
nb: trinn når de lager mat og måltider, og når de samtaler om hvordan matvalg og måltider kan påvirke helsen vår og verden vi lever i.

source: This, in turn, means being able to discuss relevant social issues and justify one’s standpoints on the basis of expert knowledge.
nb: Det betyr videre å samtale om og diskutere aktuelle samfunnsspørsmål og begrunne synspunkter og holdninger ut fra faglige kunnskaper.

source: On the other hand, Slovenia and Italy have low scores on all questions related to the use of calculators in mathematics lessons.
nb: Slovenia og Italia skårer derimot generelt lavt på alle spørsmålene om bruk av kalkulator i matematikktimene.

source: Bøe and Hognestad trailed six pedagogical leaders for one week each.
nb: Bøe og Hognestad har fotfulgt seks pedagogiske ledere hver for seg i en uke.

source: give an account of and present the main elements in the history of complex numbers from the Renaissance to Caspar Wessel
nb: gjøre rede for og presentere hovedtrekk i de komplekse tallenes historie fra renessansen til Caspar Wessel

source: Choice, use and maintenance of machines, tools and equipment related to different operational and maintenance assignments are included.
nb: Valg, bruk og vedlikehold av maskiner, redskaper og utstyr knyttet til ulike drifts- og vedlikeholdsoppgaver inngår.

source: They also demonstrate and develop competence when exploring and analysing real datasets and when making and arguing about findings.
nb: Elevene viser og utvikler også kompetanse når de utforsker og analyserer reelle datasett, og når de gjør og argumenterer for funn.

source: The programme subject covers the building of different types of parks, gardens and recreational areas, and the establishment of sports facilities.
nb: Programfaget omfatter bygging av ulike typer parker, hager og rekreasjonsområder, og etablering av idrettsanlegg.

source: publish results from his or her own examinations using digital tools
nb: publisere resultater fra egne undersøkelser ved å bruke digitale verktøy

source: Conflicts may also offer opportunities.’
nb: Det finnes også muligheter i konfliktene, mener hun.

source: Whittling sticks and chopping wood are part of day-to-day kindergarten life in Sem Kindergarten.
nb: Spikking av pinner og hogging av ved er en del av barnehagehverdagen i Sem.

source: Body and health
nb: kropp og helse

source: This means retrieving, processing and presenting mathematical information in electronic form.
nb: Det betyr å hente, bearbeide og presentere matematisk informasjon i elektronisk form.

source: The childcare workers stressed that some of the children in the cloakroom had started to cry, and the adults were concerned that there were too many children in the room at the same time.
nb: De barnehageansatte la vekt på at noen av barna i garderoben begynte å gråte, og de var opptatt av at det var for mange barn i rommet på en gang.

source: Physics and technology
nb: Fysikk og teknologi

source: It isn’t’, says the Danish researcher Merete Sørensen.
nb: Det er det ikke, mener den danske forskeren Merete Sørensen.

source: This main subject area deals with the building blocks of nature and how they are joined together, from microcosm to macrocosm.
nb: Hovedområdet handler om hvordan matematikk blir brukt som språk i fysikk, ved bruk av vektorregning, differensialregning og integralregning.

source: Mathematics X: 84 teaching hours per year Basic skills
nb: Matematikk X: 84 årstimer Grunnleggende ferdigheter

source: ✹ stimulate pupils and apprentices/trainees in their personal development,
nb: ✹ stimulere elevene og lærlingene/lærekandidatene i deres personlige

source: Rossholt has seen that kindergartens differ greatly.
nb: Rossholt har sett at barnehager er veldig forskjellige.

source: Social science is a common core subject for all primary, lower secondary and upper secondary education programmes.
nb: Samfunnsfag er et gjennomgående fag i grunnopplæringen og et fellesfag for alle utdanningsprogrammene i videregående opplæring.

source: This includes knowledge of materials, and the cleaning and maintenance of materials.
nb: I dette inngår materialkunnskap, renhold og vedlikehold av materialene.

source: use own knowledge and experience to understand and comment on the content of texts they read
nb: bruke bokstaver og eksperimentere med ord, i egen håndskrift og på tastatur

source: adapt language and genre for a given purpose and recipient and use varied and accurate vocabulary and terminology
nb: tilpasse språk og sjanger til formål og mottaker og bruke et variert og presist ordforråd og terminologi

source: assess and give feedback on oral presentations of others
nb: vurdere og gi tilbakemelding på egne og andres muntlige presentasjoner

source: Respect and care for others are also key elements in this area.
nb: Respekt og omsorg for andre står også sentralt innenfor området.

source: That makes days less stressful.
nb: Det gjør dagene mindre stressende.

source: elaborate on cell division and genetic variation and heritage
nb: beskrive oppbygningen av dyre- og planteceller og forklare hovedtrekkene i fotosyntese og celleånding

source: Children are interested in nature and sustainable development.
nb: Barn er engasjert i natur og bærekraftig utvikling.

source: describe theme and composition in texts and visual expressions
nb: beskrive tema og komposisjon i tekster og visuelle uttrykk

source: Figure 2.6 Gender differences in mathematics performance in TIMSS Advanced for all participating countries.
nb: Figur 2.6 Kjønnsforskjeller i matematikkprestasjoner i TIMSS Advanced for alle deltakende land.

source: express himself/herself in writing and orally with some precision, fluency and coherence
nb: uttrykke seg skriftlig og muntlig med en del presisjon, flyt og sammenheng

source: They pull on thick socks that Marianne has knitted especially for their rest period.
nb: De får på seg tykke sokker som Marianne har strikket spesielt med tanke på hvilestunden.

source: understand and retell simple texts in Swedish and Danish Sign Language
nb: forstå og gjenfortelle enkle tekster på svensk og dansk tegnspråk

source: write creative texts using a variety of linguistic devices
nb: skrive kreative tekster med bruk av ulike språklige virkemidler
